## For dataset1

In [1]:
import pandas as pd
df = pd.read_csv('dataset1.csv')
df

      company          job_position      degree  salary_more_than_100k
0      Google     Software Engineer     Masters                      1
1      Amazon        Data Scientist         PhD                      1
2   Microsoft  System Administrator  Associates                      0
3    Facebook       Product Manager   Bachelors                      1
4       Apple  Marketing Specialist   Bachelors                      0
..        ...                   ...         ...                    ...
95     Google  Performance Engineer     Masters                      1
96     Amazon      AI Model Trainer         PhD                      1
97  Microsoft     Technical Analyst   Bachelors                      0
98   Facebook    Support Specialist   Bachelors                      0
99      Apple          UI Developer   Bachelors                      0

[100 rows x 4 columns]

In [2]:
inputs = df.drop('salary_more_than_100k', axis='columns')
target = df['salary_more_than_100k']

In [3]:
target

0     1
1     1
2     0
3     1
4     0
     ..
95    1
96    1
97    0
98    0
99    0
Name: salary_more_than_100k, Length: 100, dtype: int64

In [4]:
inputs

      company          job_position      degree
0      Google     Software Engineer     Masters
1      Amazon        Data Scientist         PhD
2   Microsoft  System Administrator  Associates
3    Facebook       Product Manager   Bachelors
4       Apple  Marketing Specialist   Bachelors
..        ...                   ...         ...
95     Google  Performance Engineer     Masters
96     Amazon      AI Model Trainer         PhD
97  Microsoft     Technical Analyst   Bachelors
98   Facebook    Support Specialist   Bachelors
99      Apple          UI Developer   Bachelors

[100 rows x 3 columns]

In [5]:
from sklearn.preprocessing import LabelEncoder

In [6]:
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [9]:
inputs['company_n'] = le_company.fit_transform(inputs['company'])
inputs['job_n'] = le_job.fit_transform(inputs['job_position'])
inputs['degree_n'] = le_degree.fit_transform(inputs['degree'])
inputs.head()

     company          job_position      degree  company_n  job_n  degree_n
0     Google     Software Engineer     Masters          3     67         2
1     Amazon        Data Scientist         PhD          0     20         3
2  Microsoft  System Administrator  Associates          4     75         0
3   Facebook       Product Manager   Bachelors          2     52         1
4      Apple  Marketing Specialist   Bachelors          1     41         1

In [10]:
inputs_n = inputs.drop(['company', 'job_position', 'degree'], axis='columns')
inputs_n

    company_n  job_n  degree_n
0           3     67         2
1           0     20         3
2           4     75         0
3           2     52         1
4           1     41         1
..        ...    ...       ...
95          3     47         2
96          0      1         3
97          4     81         1
98          2     74         1
99          1     87         1

[100 rows x 3 columns]

In [11]:
from sklearn import tree

In [12]:
model = tree.DecisionTreeClassifier()

In [13]:
model.fit(inputs_n, target)

DecisionTreeClassifier()

In [14]:
model.score(inputs_n, target)

1.0

In [15]:
model.predict([[3,67,2]])

c:\Users\rashe\anaconda3\Lib\site-packages\sklearn\base.py:439: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([1], dtype=int64)

In [16]:
model.predict([[4,75,0]])

c:\Users\rashe\anaconda3\Lib\site-packages\sklearn\base.py:439: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([0], dtype=int64)

In [19]:
model.predict([[3,20,2]])

c:\Users\rashe\anaconda3\Lib\site-packages\sklearn\base.py:439: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([1], dtype=int64)

## For dataset2

In [20]:
import pandas as pd
df = pd.read_csv('dataset2.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [22]:
df = df.drop('PassengerId', axis='columns')

In [23]:
df = df.drop('Name', axis='columns')

In [24]:
df

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,0,3,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,female,19.0,0,0,112053,30.0000,B42,S
888,0,3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,male,26.0,0,0,111369,30.0000,C148,C
890,0,3,male,32.0,0,0,370376,7.7500,NaN,Q

In [25]:
df = df.drop('SibSp', axis='columns')

In [26]:
df = df.drop('Parch', axis='columns')

In [27]:
df = df.drop('Ticket', axis='columns')

In [28]:
df = df.drop('Cabin', axis='columns')
df = df.drop('Embarked', axis='columns')

In [29]:
df

     Survived  Pclass     Sex   Age     Fare
0           0       3    male  22.0   7.2500
1           1       1  female  38.0  71.2833
2           1       3  female  26.0   7.9250
3           1       1  female  35.0  53.1000
4           0       3    male  35.0   8.0500
..        ...     ...     ...   ...      ...
886         0       2    male  27.0  13.0000
887         1       1  female  19.0  30.0000
888         0       3  female   NaN  23.4500
889         1       1    male  26.0  30.0000
890         0       3    male  32.0   7.7500

[891 rows x 5 columns]

In [31]:
inputs = df.drop('Survived', axis='columns')
target = df['Survived']

In [32]:
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [33]:
inputs

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female   NaN  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [34]:
le_pclass = LabelEncoder()
le_sex = LabelEncoder()
le_age = LabelEncoder()
le_fare = LabelEncoder()

In [35]:
inputs['pclass_n'] = le_pclass.fit_transform(inputs['Pclass'])
inputs['sex_n'] = le_sex.fit_transform(inputs['Sex'])
inputs['age_n'] = le_age.fit_transform(inputs['Age'])
inputs['fare_n'] = le_fare.fit_transform(inputs['Fare'])
inputs.head()

   Pclass     Sex   Age     Fare  pclass_n  sex_n  age_n  fare_n
0       3    male  22.0   7.2500         2      1     28      18
1       1  female  38.0  71.2833         0      0     51     207
2       3  female  26.0   7.9250         2      0     34      41
3       1  female  35.0  53.1000         0      0     47     189
4       3    male  35.0   8.0500         2      1     47      43

In [36]:
inputs_n = inputs.drop(['Pclass', 'Sex', 'Age', 'Fare'], axis='columns')
inputs_n

     pclass_n  sex_n  age_n  fare_n
0           2      1     28      18
1           0      0     51     207
2           2      0     34      41
3           0      0     47     189
4           2      1     47      43
..        ...    ...    ...     ...
886         1      1     35      85
887         0      0     24     153
888         2      0     88     131
889         0      1     34     153
890         2      1     42      30

[891 rows x 4 columns]

In [37]:
from sklearn import tree

In [38]:
model = tree.DecisionTreeClassifier()
model.fit(inputs_n, target)

DecisionTreeClassifier()

In [44]:
model.score(inputs_n, target)

0.9797979797979798

In [40]:
model.predict([[2,1,28,18]])

c:\Users\rashe\anaconda3\Lib\site-packages\sklearn\base.py:439: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([0], dtype=int64)

In [41]:
model.predict([[0,0,51,207]])

c:\Users\rashe\anaconda3\Lib\site-packages\sklearn\base.py:439: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([1], dtype=int64)

In [50]:
model.predict([[1,1,35,85]])

c:\Users\rashe\anaconda3\Lib\site-packages\sklearn\base.py:439: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([0], dtype=int64)